[
    {
        "id": 1,
        "titulo": "Focos para estudo em React",
        "assunto": "Uma linha de penssamento para se guiar durante o estudo de React, com um passo a passo bem descritivo",
        "topicos": [
            {
                "id": 1,
                "titulo": "📝Básico de JSX",
                "descricao": "JSX é a sintaxe de marcação usada pelo React para criar elementos de interface do usuário. Entenda como funciona e como especificar atributos e elementos."
            },
            {
                "id": 2,
                "titulo": "💭Conhecimentos fundamentais",
                "descricao": "Componentes são blocos fundamentais do React, que podem ser reutilizados e combinados para criar interfaces complexas. Compreenda o que são, como usá-los, o que são props e estado e como diferenciá-los."
            },
            {
                "id": 3,
                "titulo": "🎣Hooks",
                "descricao": "Hooks são funções especiais do React que permitem usar recursos de estado e efeito dentro de componentes de função. Conheça os principais hooks, como useState e useEffect, e saiba como criar seus próprios."
            },
            {
                "id": 4,
                "titulo": "🧾Formulários e eventos:",
                "descricao": "Aprenda como usar elementos HTML como input e button dentro do React, e como lidar com eventos como onChange e onClick."
            },
            {
                "id": 5,
                "titulo": " ⚙️Fundamentos avançados",
                "descricao": "Explore conceitos como composição vs herança, componentes de alta ordem, rotas e render props."
            },
            {
                "id": 6,
                "titulo": "📦Conteúdos avançados",
                "descricao": "Saiba como otimizar a performance do seu aplicativo, usando técnicas como code-splitting, react-window e useMemo."
            },
            {
                "id": 7,
                "titulo": "✍️Gerenciadores de estado",
                "descricao": "Conheça ferramentas populares como Context, Redux e Zustand, que permitem gerenciar o estado de maneira centralizada e escalável."
            },
            {
                "id": 8,
                "titulo": "👋Requisições e gerenciamento",
                "descricao": "Descubra como fazer requisições a APIs e gerenciar dados no React, usando bibliotecas como Axios, React-query e SWR."
            },
            {
                "id": 9,
                "titulo": "🎨Estilos",
                "descricao": "Por fim, aprenda como aplicar estilos ao seu aplicativo React, usando bibliotecas como Styled Components, Radix UI, Chakra UI e Tailwind."
            }
        ]
    },
    {
        "id": 2,
        "titulo": "Commits Semanticos",
        "assunto": "A organização dos commits de um projeto é de crucial importancia e para ajudar nisso foi criado o sistema de Commits Semanticos",
        "topicos": [
            {
                "id": 1,
                "titulo": "build:",
                "descricao": "Alterações que afetam o sistema de construção ou dependências externas (escopos de exemplo: gulp, broccoli, npm);"
            },
            {
                "id": 2,
                "titulo": "ci:",
                "descricao": "Changes to our CI configuration files and scripts (example scopes: Travis, Circle, BrowserStack, SauceLabs);"
            },
            {
                "id": 3,
                "titulo": "docs:",
                "descricao": "Referem-se a inclusão ou alteração somente de arquivos de documentação;"
            },
            {
                "id": 4,
                "titulo": "feat:",
                "descricao": "Tratam adições de novas funcionalidades ou de quaisquer outras novas implantações ao código;"
            },
            {
                "id": 5,
                "titulo": " fix:",
                "descricao": " Essencialmente definem o tratamento de correções de bugs;"
            },
            {
                "id": 6,
                "titulo": "perf:",
                "descricao": "Uma alteração de código que melhora o desempenho;"
            },
            {
                "id": 7,
                "titulo": "refactor:",
                "descricao": "Tipo utilizado em quaisquer mudanças que sejam executados no código, porém não alterem a funcionalidade final da tarefa impactada;"
            },
            {
                "id": 8,
                "titulo": "style:",
                "descricao": "Alterações referentes a formatações na apresentação do código que não afetam o significado do código, como por exemplo: espaço em branco, formatação, ponto e vírgula ausente etc.);"
            },
            {
                "id": 9,
                "titulo": "test:",
                "descricao": "Adicionando testes ausentes ou corrigindo testes existentes nos processos de testes automatizados (TDD);"
            },
            {
                "id": 10,
                "titulo": "chore:",
                "descricao": "Atualização de tarefas que não ocasionam alteração no código de produção, mas mudanças de ferramentas, mudanças de configuração e bibliotecas que realmente não entram em produção;"
            },
            {
                "id": 11,
                "titulo": "env:",
                "descricao": "Basicamente utilizado na descrição de modificações ou adições em arquivos de configuração em processos e métodos de integração contínua (CI), como parâmetros em arquivos de configuração de containers."
            }
        ]
    }
]